---
kind: property
id: P:Autodesk.Revit.DB.Dimension.Above
zh: 尺寸标注、标注
source: html/a515077d-e21e-9f6d-58c2-f1f19577373d.htm
---
# Autodesk.Revit.DB.Dimension.Above Property

**中文**: 尺寸标注、标注

The text shown above the segment's value.

## Syntax (C#)
```csharp
public string Above { get; set; }
```

## Remarks
This property is for use with single-segmment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.